[
  {
    "day": 1,
    "quote": "Focus is the ability to say no to everything except what matters most. Your attention is the most valuable resource you possess.",
    "quoteSource": "The Art of Focus",
    "action": "Write down 3 things you're currently saying yes to that don't align with your most important goal. Cross one out today.",
    "actionDuration": "10 min",
    "domain": "consciousness",
    "difficulty": "beginner"
  },
  {
    "day": 2,
    "quote": "Your health is the foundation of everything. Without energy, ideas remain ideas. Without clarity, action becomes scattered.",
    "quoteSource": "4-Hour Workday",
    "action": "Walk for 20 minutes without headphones. Observe when your breath becomes shallow and consciously deepen it.",
    "actionDuration": "20 min",
    "domain": "health",
    "difficulty": "beginner"
  },
  {
    "day": 3,
    "quote": "Value is created by solving problems. The bigger the problem you solve, the more value you capture.",
    "quoteSource": "One-Person Business",
    "action": "Identify one $100 problem in your life right now. Write down what you'd pay someone to solve it.",
    "actionDuration": "15 min",
    "domain": "wealth",
    "difficulty": "beginner"
  },
  {
    "day": 4,
    "quote": "Most people adopt beliefs from society without question. Conscious living means examining what you've inherited versus what you've chosen.",
    "quoteSource": "The Self-Awareness Spiral",
    "action": "List 3 beliefs you hold about success. For each one, ask: Did I consciously choose this, or inherit it?",
    "actionDuration": "15 min",
    "domain": "consciousness",
    "difficulty": "beginner"
  },
  {
    "day": 5,
    "quote": "Relationships thrive on genuine curiosity. Ask better questions. Listen without the intent to respond.",
    "quoteSource": "The Art of Conversation",
    "action": "Ask someone today: 'What's energizing you right now?' Then listen for 5 minutes without offering advice.",
    "actionDuration": "10 min",
    "domain": "relationships",
    "difficulty": "beginner"
  },
  {
    "day": 6,
    "quote": "Writing clarifies thinking. If you can't write about it clearly, you don't understand it deeply enough.",
    "quoteSource": "Digital Economics",
    "action": "Write 250 words about one specific problem you solved this week. How did you solve it? What did you learn?",
    "actionDuration": "20 min",
    "domain": "wealth",
    "difficulty": "beginner"
  },
  {
    "day": 7,
    "quote": "Rest is not laziness. Deep work requires deep recovery. Your nervous system needs downtime to integrate growth.",
    "quoteSource": "Energy Management",
    "action": "Schedule one 30-minute block this week where you do absolutely nothing. No phone, no book, no productivity.",
    "actionDuration": "5 min",
    "domain": "health",
    "difficulty": "beginner"
  },
  {
    "day": 8,
    "quote": "You can't fix your life until you're honest about what's broken. Radical honesty is the first step to radical change.",
    "quoteSource": "How to Fix Your Life in One Day",
    "action": "Write down 5 things in your life that aren't working. Be brutally honest. Don't soften it. Just acknowledge reality.",
    "actionDuration": "15 min",
    "domain": "consciousness",
    "difficulty": "intermediate"
  },
  {
    "day": 9,
    "quote": "Your morning is your life in miniature. Win the first hour and you've already won the day.",
    "quoteSource": "How to Fix Your Life in One Day",
    "action": "Tomorrow morning, wake up and do ONE thing before touching your phone. Make it physical: walk, stretch, or cold shower.",
    "actionDuration": "30 min",
    "domain": "health",
    "difficulty": "intermediate"
  },
  {
    "day": 10,
    "quote": "You're not creating goals. You're creating a vision of who you want to become. Goals expire. Identity compounds.",
    "quoteSource": "How to Fix Your Life in One Day",
    "action": "Describe your ideal day 3 years from now. What time do you wake up? What do you do first? Who are you with? Be specific.",
    "actionDuration": "20 min",
    "domain": "consciousness",
    "difficulty": "intermediate"
  },
  {
    "day": 11,
    "quote": "Energy management beats time management. You have 24 hours regardless. The question is: how much of you is actually present?",
    "quoteSource": "How to Fix Your Life in One Day",
    "action": "Track your energy today. Every 2 hours, rate it 1-10. Notice: what drains you? What fills you? No judgments, just data.",
    "actionDuration": "5 min",
    "domain": "health",
    "difficulty": "intermediate"
  },
  {
    "day": 12,
    "quote": "The people you spend time with are either lifting you up or holding you down. There's no neutral ground.",
    "quoteSource": "How to Fix Your Life in One Day",
    "action": "List the 5 people you spend the most time with. For each, ask: Do they challenge me to grow, or reinforce my limitations?",
    "actionDuration": "15 min",
    "domain": "relationships",
    "difficulty": "intermediate"
  },
  {
    "day": 13,
    "quote": "Single-tasking is a superpower. The world rewards depth, not breadth. Go narrow, go deep, go obsessive.",
    "quoteSource": "How to Fix Your Life in One Day",
    "action": "Choose ONE project today. Remove all other tabs, apps, and distractions. Work on it for 90 uninterrupted minutes.",
    "actionDuration": "90 min",
    "domain": "wealth",
    "difficulty": "intermediate"
  },
  {
    "day": 14,
    "quote": "You're either a creator or a consumer. There is no middle ground. Every hour you spend consuming is an hour you're not building.",
    "quoteSource": "How to Fix Your Life in One Day",
    "action": "Create something today. Anything. A tweet, a sketch, 500 words, a video. Just make something that didn't exist before.",
    "actionDuration": "30 min",
    "domain": "wealth",
    "difficulty": "intermediate"
  }
]