[
  {
    "day": 1,
    "quote": "Focus is the ability to say no to everything except what matters most. Your attention is the most valuable resource you possess.",
    "quoteSource": "The Art of Focus",
    "action": "Write down 3 things you're currently saying yes to that don't align with your most important goal. Cross one out today.",
    "actionDuration": "10 min",
    "domain": "consciousness",
    "difficulty": "beginner"
  },
  {
    "day": 2,
    "quote": "Your health is the foundation of everything. Without energy, ideas remain ideas. Without clarity, action becomes scattered.",
    "quoteSource": "4-Hour Workday",
    "action": "Walk for 20 minutes without headphones. Observe when your breath becomes shallow and consciously deepen it.",
    "actionDuration": "20 min",
    "domain": "health",
    "difficulty": "beginner"
  },
  {
    "day": 3,
    "quote": "Value is created by solving problems. The bigger the problem you solve, the more value you capture.",
    "quoteSource": "One-Person Business",
    "action": "Identify one $100 problem in your life right now. Write down what you'd pay someone to solve it.",
    "actionDuration": "15 min",
    "domain": "wealth",
    "difficulty": "beginner"
  },
  {
    "day": 4,
    "quote": "Most people adopt beliefs from society without question. Conscious living means examining what you've inherited versus what you've chosen.",
    "quoteSource": "The Self-Awareness Spiral",
    "action": "List 3 beliefs you hold about success. For each one, ask: Did I consciously choose this, or inherit it?",
    "actionDuration": "15 min",
    "domain": "consciousness",
    "difficulty": "beginner"
  },
  {
    "day": 5,
    "quote": "Relationships thrive on genuine curiosity. Ask better questions. Listen without the intent to respond.",
    "quoteSource": "The Art of Conversation",
    "action": "Ask someone today: 'What's energizing you right now?' Then listen for 5 minutes without offering advice.",
    "actionDuration": "10 min",
    "domain": "relationships",
    "difficulty": "beginner"
  },
  {
    "day": 6,
    "quote": "Writing clarifies thinking. If you can't write about it clearly, you don't understand it deeply enough.",
    "quoteSource": "Digital Economics",
    "action": "Write 250 words about one specific problem you solved this week. How did you solve it? What did you learn?",
    "actionDuration": "20 min",
    "domain": "wealth",
    "difficulty": "beginner"
  },
  {
    "day": 7,
    "quote": "Rest is not laziness. Deep work requires deep recovery. Your nervous system needs downtime to integrate growth.",
    "quoteSource": "Energy Management",
    "action": "Schedule one 30-minute block this week where you do absolutely nothing. No phone, no book, no productivity.",
    "actionDuration": "5 min",
    "domain": "health",
    "difficulty": "beginner"
  },
  {
    "day": 8,
    "quote": "You can't fix your life until you're honest about what's broken. Radical honesty is the first step to radical change.",
    "quoteSource": "How to Fix Your Life in One Day",
    "action": "Write down 5 things in your life that aren't working. Be brutally honest. Don't soften it. Just acknowledge reality.",
    "actionDuration": "15 min",
    "domain": "consciousness",
    "difficulty": "intermediate"
  },
  {
    "day": 9,
    "quote": "Your morning is your life in miniature. Win the first hour and you've already won the day.",
    "quoteSource": "How to Fix Your Life in One Day",
    "action": "Tomorrow morning, wake up and do ONE thing before touching your phone. Make it physical: walk, stretch, or cold shower.",
    "actionDuration": "30 min",
    "domain": "health",
    "difficulty": "intermediate"
  },
  {
    "day": 10,
    "quote": "You're not creating goals. You're creating a vision of who you want to become. Goals expire. Identity compounds.",
    "quoteSource": "How to Fix Your Life in One Day",
    "action": "Describe your ideal day 3 years from now. What time do you wake up? What do you do first? Who are you with? Be specific.",
    "actionDuration": "20 min",
    "domain": "consciousness",
    "difficulty": "intermediate"
  },
  {
    "day": 11,
    "quote": "Energy management beats time management. You have 24 hours regardless. The question is: how much of you is actually present?",
    "quoteSource": "How to Fix Your Life in One Day",
    "action": "Track your energy today. Every 2 hours, rate it 1-10. Notice: what drains you? What fills you? No judgments, just data.",
    "actionDuration": "5 min",
    "domain": "health",
    "difficulty": "intermediate"
  },
  {
    "day": 12,
    "quote": "The people you spend time with are either lifting you up or holding you down. There's no neutral ground.",
    "quoteSource": "How to Fix Your Life in One Day",
    "action": "List the 5 people you spend the most time with. For each, ask: Do they challenge me to grow, or reinforce my limitations?",
    "actionDuration": "15 min",
    "domain": "relationships",
    "difficulty": "intermediate"
  },
  {
    "day": 13,
    "quote": "Single-tasking is a superpower. The world rewards depth, not breadth. Go narrow, go deep, go obsessive.",
    "quoteSource": "How to Fix Your Life in One Day",
    "action": "Choose ONE project today. Remove all other tabs, apps, and distractions. Work on it for 90 uninterrupted minutes.",
    "actionDuration": "90 min",
    "domain": "wealth",
    "difficulty": "intermediate"
  },
  {
    "day": 14,
    "quote": "You're either a creator or a consumer. There is no middle ground. Every hour you spend consuming is an hour you're not building.",
    "quoteSource": "How to Fix Your Life in One Day",
    "action": "Create something today. Anything. A tweet, a sketch, 500 words, a video. Just make something that didn't exist before.",
    "actionDuration": "30 min",
    "domain": "wealth",
    "difficulty": "intermediate"
  },
  {
    "day": 15,
    "quote": "Your business model is your life model. If your business drains you, your life will reflect that exhaustion.",
    "quoteSource": "One-Person Business Framework",
    "action": "List 3 ways you currently make or could make money. Circle the one that energizes you most. Why?",
    "actionDuration": "15 min",
    "domain": "wealth",
    "difficulty": "intermediate"
  },
  {
    "day": 16,
    "quote": "Clarity comes from action, not thought. You don't think your way into a new life. You act your way into a new way of thinking.",
    "quoteSource": "The Action Bias",
    "action": "Pick one small decision you've been overthinking. Set a 5-minute timer. Decide by the time it ends. Then act immediately.",
    "actionDuration": "10 min",
    "domain": "consciousness",
    "difficulty": "intermediate"
  },
  {
    "day": 17,
    "quote": "Your body is the vehicle for your mind. Neglect the vehicle and the mind goes nowhere.",
    "quoteSource": "Physical Intelligence",
    "action": "Do 10 push-ups, 10 squats, and stretch for 2 minutes. Right now. No excuses. Notice how your mind feels after.",
    "actionDuration": "5 min",
    "domain": "health",
    "difficulty": "intermediate"
  },
  {
    "day": 18,
    "quote": "Boundaries aren't walls. They're filters. They keep the wrong things out so the right things can flourish.",
    "quoteSource": "The Art of Saying No",
    "action": "Identify one person or commitment that consistently drains your energy. Write one sentence declining their next request.",
    "actionDuration": "10 min",
    "domain": "relationships",
    "difficulty": "intermediate"
  },
  {
    "day": 19,
    "quote": "Boredom is the birthplace of creativity. Your best ideas emerge when you stop filling every moment with stimulation.",
    "quoteSource": "The Attention Economy",
    "action": "Sit in silence for 10 minutes. No music, no podcast, no scrolling. Just you and your thoughts. What emerges?",
    "actionDuration": "10 min",
    "domain": "consciousness",
    "difficulty": "intermediate"
  },
  {
    "day": 20,
    "quote": "Skills compound. Credentials expire. Invest in what you can't take away from yourself.",
    "quoteSource": "The New Education",
    "action": "Choose one skill you want to build. Spend 30 minutes today learning it through practice, not theory.",
    "actionDuration": "30 min",
    "domain": "wealth",
    "difficulty": "intermediate"
  },
  {
    "day": 21,
    "quote": "Sleep is the foundation. Everything else is decoration. Sacrifice sleep and you sacrifice everything built on top of it.",
    "quoteSource": "Recovery Protocols",
    "action": "Set a sleep alarm for tonight. 8 hours before you need to wake up. When it goes off, stop everything and go to bed.",
    "actionDuration": "5 min",
    "domain": "health",
    "difficulty": "intermediate"
  },
  {
    "day": 22,
    "quote": "Your environment shapes your identity more than your willpower ever will. Design the environment, and behavior follows.",
    "quoteSource": "Environmental Design",
    "action": "Remove one distraction from your workspace. Delete one app. Unfollow 5 accounts. Make the default path the productive path.",
    "actionDuration": "10 min",
    "domain": "consciousness",
    "difficulty": "advanced"
  },
  {
    "day": 23,
    "quote": "Comparison is the thief of joy only when you compare your process to someone else's results. Compare trajectories, not snapshots.",
    "quoteSource": "The Comparison Trap",
    "action": "Think of someone you admire. Instead of envying their current position, research their first 3 years. What did THAT look like?",
    "actionDuration": "20 min",
    "domain": "consciousness",
    "difficulty": "advanced"
  },
  {
    "day": 24,
    "quote": "Deep relationships require presence. Presence requires putting down your phone and looking people in the eyes.",
    "quoteSource": "The Presence Practice",
    "action": "Tonight, put your phone in another room during dinner or conversation. Notice the difference in connection quality.",
    "actionDuration": "30 min",
    "domain": "relationships",
    "difficulty": "advanced"
  },
  {
    "day": 25,
    "quote": "Resistance reveals importance. The things you avoid most are often the things that would change your life most.",
    "quoteSource": "The Resistance Principle",
    "action": "Identify the one task you've been avoiding for weeks. Do it for just 10 minutes today. Just start. Momentum handles the rest.",
    "actionDuration": "10 min",
    "domain": "wealth",
    "difficulty": "advanced"
  },
  {
    "day": 26,
    "quote": "Fasting isn't about deprivation. It's about giving your body space to heal instead of constantly processing input.",
    "quoteSource": "Metabolic Intelligence",
    "action": "Skip breakfast tomorrow. Have your first meal at noon. Notice your mental clarity in the morning. Track how you feel.",
    "actionDuration": "5 min",
    "domain": "health",
    "difficulty": "advanced"
  },
  {
    "day": 27,
    "quote": "Your self-image is the ceiling of your potential. You can't outperform your identity. Upgrade the story you tell about yourself.",
    "quoteSource": "Identity Architecture",
    "action": "Complete this sentence 10 times: 'I am the type of person who...' Write identities, not achievements.",
    "actionDuration": "15 min",
    "domain": "consciousness",
    "difficulty": "advanced"
  },
  {
    "day": 28,
    "quote": "Teaching is the highest form of learning. You don't truly understand something until you can explain it simply to others.",
    "quoteSource": "The Teaching Method",
    "action": "Pick one thing you learned this month. Write a 300-word explanation as if teaching a complete beginner. Post it somewhere.",
    "actionDuration": "25 min",
    "domain": "wealth",
    "difficulty": "advanced"
  }
]